app/Controllers/User.php

SELECT *
FROM `tb_users`
WHERE `username` = 'user1@example.com'
 LIMIT 1
SELECT *
FROM `user_config`
WHERE `user_id` = '2'
 LIMIT 1
---
    public function tombollogin()
    {
        $session = session();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();

        if ($user && password_verify($password, $user['password'])) {
            $session->set('logged_in', true);
            $session->set('user', $user);

            $userConfigModel = new UserConfigModel(); // Ubah nama variabel agar sesuai dengan model
            $userConfig = $userConfigModel->where('user_id', $user['user_id'])->first();